{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Defines feature evidence entries linking features to related source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for key frontend files describing their roles in routing, UI, and business logic.",
  "frontend/index.css": "Tailwind base definitions with OKLCH color variables and dark mode overrides.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for all main pages.",
  "frontend/src/components/CustomerOrderProgress.tsx": "Shows the current step of the customer order flow with labeled progress indicators.",
  "frontend/src/components/DishImageModal.tsx": "Modal component for displaying an enlarged dish image with dismiss controls.",
  "frontend/src/components/Footer.tsx": "Renders project footer text, thank‑you message, attribution link, and copyright.",
  "frontend/src/components/Header.tsx": "Navigation header with desktop and mobile menus using TanStack Router navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching when identity changes.",
  "frontend/src/hooks/useCustomerOrderFlow.ts": "Manages the four‑step customer order process, including cart, menu items, delivery details, and order progression.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useOrderTracking.ts": "Implements timed order status progression with start, reset, and current status tracking logic.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for future query logic.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/AboutProject.tsx": "Displays an overview of the project with feature cards and descriptive sections.",
  "frontend/src/pages/CustomerPortal.tsx": "Implements the customer ordering flow with menu browsing, cart steps, form entry, image modal, and order tracking.",
  "frontend/src/pages/DeliveryPortal.tsx": "Provides a UI-only delivery partner dashboard with login and delivery status management.",
  "frontend/src/pages/Home.tsx": "Home page showing hero text and three portal cards that navigate to customer, restaurant, and delivery sections.",
  "frontend/src/pages/RestaurantPortal.tsx": "Restaurant dashboard with a mock login, sample orders, and controls to accept or reject orders.",
  "frontend/src/pages/Technologies.tsx": "Page displaying categorized lists of frontend, backend, database, and tooling technologies with icons and descriptions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, container settings, animations, and plugin integrations.",
  "project_state.json": "Metadata describing project state, requirements, known issues, and planned UI flow for the food ordering system."
}