{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping features to involved files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their roles.",
  "frontend/index.css": "Tailwind base layers defining OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "HTML entry point mounting React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for all portal pages.",
  "frontend/src/components/CustomerOrderProgress.tsx": "Progress indicator showing current order step with labels and bars.",
  "frontend/src/components/DishImageModal.tsx": "Modal displaying enlarged dish image with close controls.",
  "frontend/src/components/Footer.tsx": "Footer showing project text, attribution link, and copyright year.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation buttons and mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Hook creating authenticated or anonymous backend actor and invalidating queries on change.",
  "frontend/src/hooks/useCustomerOrderFlow.ts": "Hook managing 4‑step customer flow, cart state, totals, and order placement.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication, including login, logout, and identity persistence. Wraps AuthClient setup with configurable options and exposes status helpers.",
  "frontend/src/hooks/useOrderTracking.ts": "Provides a hook that simulates order status progression over time using timers. Supports starting, resetting, and tracking the current step of an order.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are unused due to a mock backend.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes. Applies global background, text, and border styling.",
  "frontend/src/main.tsx": "Initializes the React app root and wraps it with QueryClientProvider and InternetIdentityProvider. Loads global styles and renders the main App component.",
  "frontend/src/pages/AboutProject.tsx": "Displays an overview of the food ordering system with feature cards and project details. Focuses on UI demonstration and conceptual backend explanation.",
  "frontend/src/pages/CustomerPortal.tsx": "Implements a multi-step customer ordering flow with menu browsing, cart management, details form, and simulated order tracking. Integrates order state from custom hooks and renders step-specific UI.",
  "frontend/src/pages/DeliveryPortal.tsx": "Provides a UI-only delivery partner dashboard with login simulation and status updates for sample delivery orders. Allows marking orders as picked up or delivered with toast notifications.",
  "frontend/src/pages/Home.tsx": "Home page showing hero text and cards linking to customer, restaurant, and delivery portals.",
  "frontend/src/pages/RestaurantPortal.tsx": "Restaurant portal with a login screen and a dashboard to view, accept, or reject sample orders, plus menu management tabs.",
  "frontend/src/pages/Technologies.tsx": "Technologies page listing frontend, backend, database, and tooling stacks with categorized cards and descriptions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing scope, requirements, architectural notes, and known issues for the food ordering system frontend."
}