{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind styles defining OKLCH color variables and base theming.",
  "frontend/index.html": "HTML entry point with root div and script loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and a layout with header and footer.",
  "frontend/src/components/DishImageModal.tsx": "Modal showing an enlarged dish image with close controls.",
  "frontend/src/components/Footer.tsx": "Footer displaying project info, attribution, and dynamic year.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation links and mobile menu sheet.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing a backend actor based on identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login state and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder for query-related logic since data is mocked.",
  "frontend/src/index.css": "Global Tailwind theme definitions using updated OKLCH color tokens.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider, rendering the App component.",
  "frontend/src/pages/AboutProject.tsx": "Displays project overview, user roles, and implementation details for the food ordering system UI demo.",
  "frontend/src/pages/CustomerPortal.tsx": "Implements a customer login flow, restaurant browsing, ordering UI, and simulated order status updates.",
  "frontend/src/pages/DeliveryPortal.tsx": "Provides delivery partner login and a dashboard to view, pick up, and complete delivery tasks with sample data.",
  "frontend/src/pages/Home.tsx": "Shows homepage hero content and navigation cards for customer, restaurant, and delivery portals.",
  "frontend/src/pages/RestaurantPortal.tsx": "Includes restaurant login and a dashboard to manage sample orders and menu items with accept/reject actions.",
  "frontend/src/pages/Technologies.tsx": "Lists frontend, backend, database, and tooling technologies used, with descriptions and categorized UI cards.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file describing the Online Food Ordering System frontend, including requirements, features, images, and architectural notes."
}