{
  "kind": "build_request",
  "title": "Update Customer order tracking behavior and add dish images with modal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Add real dish images for the Customer Portal menu items (Pizza, Burger, Biryani) as static assets and display them in Step 1 (Restaurant & Menu) for each menu card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "change order tracking and add images to dishes"
        ]
      },
      "acceptanceCriteria": [
        "Three new image files exist under frontend/public/assets/generated and are referenced by the menu UI: pizza, burger, biryani.",
        "In /customer Step 1, each menu card shows the dish image above or alongside the dish name/price.",
        "Each image has appropriate English alt text matching the dish name (e.g., \"Pizza\").",
        "No other steps (Cart, Delivery Details, Order Tracking) display the menu images."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Make each dish image in the Customer Portal Step 1 clickable so that clicking opens a dismissible modal displaying a larger version of that dish image, without breaking the existing “Add to Cart” button behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "change order tracking and add images to dishes"
        ]
      },
      "acceptanceCriteria": [
        "Clicking a dish image opens a modal showing a larger version of that dish image.",
        "The modal can be dismissed via close control and by standard dialog dismissal behavior.",
        "Clicking “Add to Cart” still adds the correct item and does not open the image modal.",
        "The existing DishImageModal component is used (or equivalent modal behavior is implemented without editing read-only UI component sources)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Change the Customer Portal order tracking so it reliably starts fresh for each newly placed order and progresses through the statuses in the correct sequence for the most recent order only: Order Received → Preparing → Out for Delivery → Delivered.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "change order tracking and add images to dishes"
        ]
      },
      "acceptanceCriteria": [
        "After placing an order in Step 3, Step 4 immediately shows status \"Order Received\" for that new order.",
        "The status progresses in order: \"Order Received\" → \"Preparing\" → \"Out for Delivery\" → \"Delivered\" without skipping or reverting.",
        "Placing a second order in the same session restarts tracking from \"Order Received\" and is not affected by the previous order’s timers/state.",
        "No React warnings occur from timers updating state after navigating away/unmounting the Customer Portal page."
      ]
    }
  ],
  "constraints": [
    "Frontend must remain React + TypeScript + Tailwind + React Query (no new frameworks).",
    "Do not edit files under frontend/src/components/ui (compose them instead).",
    "Backend remains a single Motoko actor; no backend changes are required for these UI-only updates."
  ],
  "nonGoals": [
    "Add real authentication or persistent order storage.",
    "Add payments, delivery maps, push notifications, or real-time backend updates."
  ],
  "imageRequirements": {
    "required": [
      "Realistic photo of a pizza on a plate (pizza.dim_800x600.png)",
      "Realistic photo of a burger on a plate (burger.dim_800x600.png)",
      "Realistic photo of biryani in a bowl (biryani.dim_800x600.png)"
    ],
    "edits": []
  }
}