{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Customer Portal: Dish images with modal + fresh order tracking per new order",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Add static dish images (pizza, burger, biryani) and render them on Customer Portal Step 1 menu cards only.",
      "acceptanceCriteria": [
        "Three new image files exist under frontend/public/assets/generated and are referenced by the menu UI: pizza, burger, biryani.",
        "In /customer Step 1, each menu card shows the dish image above or alongside the dish name/price.",
        "Each image has appropriate English alt text matching the dish name (e.g., \"Pizza\").",
        "No other steps (Cart, Delivery Details, Order Tracking) display the menu images."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/pizza.dim_800x600.png",
          "operation": "create",
          "description": "Add the required static dish image asset for Pizza at this exact path/filename so it can be referenced by the Step 1 menu UI."
        },
        {
          "path": "frontend/public/assets/generated/burger.dim_800x600.png",
          "operation": "create",
          "description": "Add the required static dish image asset for Burger at this exact path/filename so it can be referenced by the Step 1 menu UI."
        },
        {
          "path": "frontend/public/assets/generated/biryani.dim_800x600.png",
          "operation": "create",
          "description": "Add the required static dish image asset for Biryani at this exact path/filename so it can be referenced by the Step 1 menu UI."
        },
        {
          "path": "frontend/src/pages/CustomerPortal.tsx",
          "operation": "modify",
          "description": "Update Step 1 (Restaurant & Menu) menu cards to render the corresponding dish image (using the new static assets) for Pizza/Burger/Biryani with alt text equal to the dish name, and ensure images are not rendered in Steps 2–4."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Make Step 1 dish images clickable to open a dismissible modal with a larger image while preserving Add to Cart behavior.",
      "acceptanceCriteria": [
        "Clicking a dish image opens a modal showing a larger version of that dish image.",
        "The modal can be dismissed via close control and by standard dialog dismissal behavior.",
        "Clicking “Add to Cart” still adds the correct item and does not open the image modal.",
        "The existing DishImageModal component is used (or equivalent modal behavior is implemented without editing read-only UI component sources)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CustomerPortal.tsx",
          "operation": "modify",
          "description": "Wire image click handling in Step 1 to open a modal for the selected dish image, and ensure the Add to Cart button click does not trigger the modal (e.g., separate click targets / stop propagation as needed). Use the existing DishImageModal component to provide the modal behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/DishImageModal.tsx",
          "operation": "modify",
          "description": "If needed, adjust DishImageModal public props/behavior to better support Step 1 usage (dismissible close control + standard dialog dismissal) without editing any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Ensure order tracking restarts cleanly per newly placed order and progresses in the correct status sequence for only the latest order, without timer-related React warnings.",
      "acceptanceCriteria": [
        "After placing an order in Step 3, Step 4 immediately shows status \"Order Received\" for that new order.",
        "The status progresses in order: \"Order Received\" → \"Preparing\" → \"Out for Delivery\" → \"Delivered\" without skipping or reverting.",
        "Placing a second order in the same session restarts tracking from \"Order Received\" and is not affected by the previous order’s timers/state.",
        "No React warnings occur from timers updating state after navigating away/unmounting the Customer Portal page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CustomerPortal.tsx",
          "operation": "modify",
          "description": "Update the Step 3 place-order submit flow to explicitly restart tracking for each newly placed order (reset then start, or equivalent), so Step 4 renders \"Order Received\" for the latest order immediately after submission and remains tied to that latest order only."
        },
        {
          "path": "frontend/src/hooks/useOrderTracking.ts",
          "operation": "modify",
          "description": "Harden the simulated tracking hook so each new tracking run cancels/invalidates prior timers and progresses strictly through: Order Received → Preparing → Out for Delivery → Delivered, and ensure timers are fully cleaned up to prevent state updates after unmount."
        }
      ]
    }
  ]
}